# Pandas (Panel Data)

In [1]:
import numpy as np
import pandas as pd

In [3]:
pd.__version__

'1.1.2'

In [ ]:
# df = pd.read_csv('https://raw.githubusercontent.com/ardhiraka/PFDS_sources/master/nbaallelo.csv')

In [16]:
# df = pd.read_csv('patient.csv')

In [4]:
df_salary = pd.read_csv('https://raw.githubusercontent.com/ardhiraka/PFDS_sources/master/Salary_Data.csv')

In [36]:
df_salary

    YearsExperience    Salary
0               1.1   39343.0
1               1.3   46205.0
2               1.5   37731.0
3               2.0   43525.0
4               2.2   39891.0
5               2.9   56642.0
6               3.0   60150.0
7               3.2   54445.0
8               3.2   64445.0
9               3.7   57189.0
10              3.9   63218.0
11              4.0   55794.0
12              4.0   56957.0
13              4.1   57081.0
14              4.5   61111.0
15              4.9   67938.0
16              5.1   66029.0
17              5.3   83088.0
18              5.9   81363.0
19              6.0   93940.0
20              6.8   91738.0
21              7.1   98273.0
22              7.9  101302.0
23              8.2  113812.0
24              8.7  109431.0
25              9.0  105582.0
26              9.5  116969.0
27              9.6  112635.0
28             10.3  122391.0
29             10.5  121872.0

In [37]:
type(df_salary)

pandas.core.frame.DataFrame

In [38]:
df_salary.shape

(30, 2)

In [39]:
num_rows, num_cols = df_salary.shape
print ("Number of Rows:", num_rows)
print ("Number of Columns:", num_cols)

Number of Rows: 30
Number of Columns: 2

In [40]:
df_salary.head() #secara default, akan menampilkan 5 data pertama

   YearsExperience   Salary
0              1.1  39343.0
1              1.3  46205.0
2              1.5  37731.0
3              2.0  43525.0
4              2.2  39891.0

In [30]:
df_salary.head(10) #menampilkan 10 data pertama

   YearsExperience   Salary
0              1.1  39343.0
1              1.3  46205.0
2              1.5  37731.0
3              2.0  43525.0
4              2.2  39891.0
5              2.9  56642.0
6              3.0  60150.0
7              3.2  54445.0
8              3.2  64445.0
9              3.7  57189.0

In [31]:
df_salary.tail() #secara default, akan menampilkan 5 data terakhir

    YearsExperience    Salary
25              9.0  105582.0
26              9.5  116969.0
27              9.6  112635.0
28             10.3  122391.0
29             10.5  121872.0

In [32]:
df_salary.tail(10) #menampilkan 10 data terakhir

    YearsExperience    Salary
20              6.8   91738.0
21              7.1   98273.0
22              7.9  101302.0
23              8.2  113812.0
24              8.7  109431.0
25              9.0  105582.0
26              9.5  116969.0
27              9.6  112635.0
28             10.3  122391.0
29             10.5  121872.0

In [41]:
df_salary.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 2 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   YearsExperience  30 non-null     float64
 1   Salary           30 non-null     float64
dtypes: float64(2)
memory usage: 608.0 bytes

In [2]:
df_patient = pd.read_csv('patient.csv')
df_nba = pd.read_csv('https://raw.githubusercontent.com/ardhiraka/PFDS_sources/master/nbaallelo.csv')

In [6]:
print ("Shape of Dataframe Patient.csv is:", df_patient.shape)
print ("Shape of Dataframe NBA.csv is:", df_nba.shape)

Shape of Dataframe Patient.csv is: (893, 11)
Shape of Dataframe NBA.csv is: (126314, 23)

In [7]:
df_patient.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 893 entries, 0 to 892
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   patient_id      893 non-null    int64
 1   gender          156 non-null    object
 2   age             156 non-null    float64
 3   nationality     156 non-null    object
 4   province        156 non-null    object
 5   current_state   166 non-null    object
 6   contacted_with  27 non-null     float64
 7   confirmed_date  893 non-null    object
 8   released_date   5 non-null      object
 9   deceased_date   4 non-null      object
 10  hospital        17 non-null     object
dtypes: float64(2), int64(1), object(8)
memory usage: 76.9+ KB

In [52]:
df_nba.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 126314 entries, 0 to 126313
Data columns (total 23 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   gameorder      126314 non-null  int64
 1   game_id        126314 non-null  object
 2   lg_id          126314 non-null  object
 3   _iscopy        126314 non-null  int64
 4   year_id        126314 non-null  int64
 5   date_game      126314 non-null  object
 6   seasongame     126314 non-null  int64
 7   is_playoffs    126314 non-null  int64
 8   team_id        126314 non-null  object
 9   fran_id        126314 non-null  object
 10  pts            126314 non-null  int64
 11  elo_i          126314 non-null  float64
 12  elo_n          126314 non-null  float64
 13  win_equiv      126314 non-null  float64
 14  opp_id         126314 non-null  object
 15  opp_fran       126314 non-null  object
 16  opp_pts        126314 non-null  int64
 17  opp_elo_i      126314 non-null  float64
 18  opp_elo_n      126314 non-null  float64
 19  game_location  126314 non-null  object
 20  game_result    126314 non-null  object
 21  forecast       126314 non-null  float64
 22  notes          5424 non-null    object
dtypes: float64(6), int64(7), object(10)
memory usage: 22.2+ MB

In [48]:
df_patient

,patient_id,gender,age,nationality,province,current_state,contacted_with,confirmed_date,released_date,deceased_date,hospital
0,1,female,31.0,indonesia,DKI Jakarta,released,NaN,2-Mar-20,13-Mar-20,NaN,RSPI Sulianti Saroso
1,2,female,64.0,indonesia,DKI Jakarta,released,1.0,2-Mar-20,16-Mar-20,NaN,RSPI Sulianti Saroso
2,3,female,33.0,indonesia,DKI Jakarta,released,1.0,6-Mar-20,13-Mar-20,NaN,RSPI Sulianti Saroso
3,4,female,34.0,indonesia,DKI Jakarta,isolated,1.0,6-Mar-20,NaN,NaN,RSPI Sulianti Saroso
4,5,male,55.0,indonesia,DKI Jakarta,isolated,1.0,8-Mar-20,NaN,NaN,RS Persahabatan
...,...,...,...,...,...,...,...,...,...,...,...
888,889,NaN,NaN,NaN,NaN,NaN,NaN,26-Mar-20,NaN,NaN,NaN
889,890,NaN,NaN,NaN,NaN,NaN,NaN,26-Mar-20,NaN,NaN,NaN
890,891,NaN,NaN,NaN,NaN,NaN,NaN,26-Mar-20,NaN,NaN,NaN
891,892,NaN,NaN,NaN,NaN,NaN,NaN,26-Mar-20,NaN,NaN,NaN
892,893,NaN,NaN,NaN,NaN,NaN,NaN,26-Mar-20,NaN,NaN,NaN

In [14]:
df_nba

,gameorder,game_id,lg_id,_iscopy,year_id,date_game,seasongame,is_playoffs,team_id,fran_id,...,win_equiv,opp_id,opp_fran,opp_pts,opp_elo_i,opp_elo_n,game_location,game_result,forecast,notes
0,1,194611010TRH,NBA,0,1947,11/1/1946,1,0,TRH,Huskies,...,40.294830,NYK,Knicks,68,1300.0000,1306.7233,H,L,0.640065,NaN
1,1,194611010TRH,NBA,1,1947,11/1/1946,1,0,NYK,Knicks,...,41.705170,TRH,Huskies,66,1300.0000,1293.2767,A,W,0.359935,NaN
2,2,194611020CHS,NBA,0,1947,11/2/1946,1,0,CHS,Stags,...,42.012257,NYK,Knicks,47,1306.7233,1297.0712,H,W,0.631101,NaN
3,2,194611020CHS,NBA,1,1947,11/2/1946,2,0,NYK,Knicks,...,40.692783,CHS,Stags,63,1300.0000,1309.6521,A,L,0.368899,NaN
4,3,194611020DTF,NBA,0,1947,11/2/1946,1,0,DTF,Falcons,...,38.864048,WSC,Capitols,50,1300.0000,1320.3811,H,L,0.640065,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
126309,63155,201506110CLE,NBA,0,2015,6/11/2015,100,1,CLE,Cavaliers,...,60.309792,GSW,Warriors,103,1790.9591,1809.9791,H,L,0.546572,NaN
126310,63156,201506140GSW,NBA,0,2015,6/14/2015,102,1,GSW,Warriors,...,68.013329,CLE,Cavaliers,91,1704.3949,1700.7391,H,W,0.765565,NaN
126311,63156,201506140GSW,NBA,1,2015,6/14/2015,101,1,CLE,Cavaliers,...,60.010067,GSW,Warriors,104,1809.9791,1813.6349,A,L,0.234435,NaN
126312,63157,201506170CLE,NBA,0,2015,6/16/2015,102,1,CLE,Cavaliers,...,59.290245,GSW,Warriors,105,1813.6349,1822.2881,H,L,0.481450,NaN
126313,63157,201506170CLE,NBA,1,2015,6/16/2015,103,1,GSW,Warriors,...,68.519516,CLE,Cavaliers,97,1700.7391,1692.0859,A,W,0.518550,NaN

In [54]:
df_patient.head(10)

,patient_id,gender,age,nationality,province,current_state,contacted_with,confirmed_date,released_date,deceased_date,hospital
0,1,female,31.0,indonesia,DKI Jakarta,released,NaN,2-Mar-20,13-Mar-20,NaN,RSPI Sulianti Saroso
1,2,female,64.0,indonesia,DKI Jakarta,released,1.0,2-Mar-20,16-Mar-20,NaN,RSPI Sulianti Saroso
2,3,female,33.0,indonesia,DKI Jakarta,released,1.0,6-Mar-20,13-Mar-20,NaN,RSPI Sulianti Saroso
3,4,female,34.0,indonesia,DKI Jakarta,isolated,1.0,6-Mar-20,NaN,NaN,RSPI Sulianti Saroso
4,5,male,55.0,indonesia,DKI Jakarta,isolated,1.0,8-Mar-20,NaN,NaN,RS Persahabatan
5,6,male,36.0,indonesia,DKI Jakarta,released,NaN,8-Mar-20,11-Mar-20,NaN,RS Persahabatan
6,7,female,54.0,indonesia,DKI Jakarta,released,8.0,9-Mar-20,NaN,NaN,NaN
7,8,male,55.0,indonesia,DKI Jakarta,released,NaN,9-Mar-20,NaN,NaN,NaN
8,9,female,55.0,indonesia,DKI Jakarta,released,NaN,9-Mar-20,NaN,NaN,NaN
9,10,male,29.0,foreigner,DKI Jakarta,isolated,1.0,9-Mar-20,NaN,NaN,RSPI Sulianti Saroso

In [18]:
with pd.option_context("display.max.columns", None):
    df_nba.head(10)
    display (df_nba.head(10))

,gameorder,game_id,lg_id,_iscopy,year_id,date_game,seasongame,is_playoffs,team_id,fran_id,pts,elo_i,elo_n,win_equiv,opp_id,opp_fran,opp_pts,opp_elo_i,opp_elo_n,game_location,game_result,forecast,notes
0,1,194611010TRH,NBA,0,1947,11/1/1946,1,0,TRH,Huskies,66,1300.0000,1293.2767,40.294830,NYK,Knicks,68,1300.0000,1306.7233,H,L,0.640065,NaN
1,1,194611010TRH,NBA,1,1947,11/1/1946,1,0,NYK,Knicks,68,1300.0000,1306.7233,41.705170,TRH,Huskies,66,1300.0000,1293.2767,A,W,0.359935,NaN
2,2,194611020CHS,NBA,0,1947,11/2/1946,1,0,CHS,Stags,63,1300.0000,1309.6521,42.012257,NYK,Knicks,47,1306.7233,1297.0712,H,W,0.631101,NaN
3,2,194611020CHS,NBA,1,1947,11/2/1946,2,0,NYK,Knicks,47,1306.7233,1297.0712,40.692783,CHS,Stags,63,1300.0000,1309.6521,A,L,0.368899,NaN
4,3,194611020DTF,NBA,0,1947,11/2/1946,1,0,DTF,Falcons,33,1300.0000,1279.6189,38.864048,WSC,Capitols,50,1300.0000,1320.3811,H,L,0.640065,NaN
5,3,194611020DTF,NBA,1,1947,11/2/1946,1,0,WSC,Capitols,50,1300.0000,1320.3811,43.135952,DTF,Falcons,33,1300.0000,1279.6189,A,W,0.359935,NaN
6,4,194611020PRO,NBA,1,1947,11/2/1946,1,0,BOS,Celtics,53,1300.0000,1294.8458,40.459381,PRO,Steamrollers,59,1300.0000,1305.1542,A,L,0.359935,NaN
7,4,194611020PRO,NBA,0,1947,11/2/1946,1,0,PRO,Steamrollers,59,1300.0000,1305.1542,41.540619,BOS,Celtics,53,1300.0000,1294.8458,H,W,0.640065,NaN
8,5,194611020STB,NBA,1,1947,11/2/1946,1,0,PIT,Ironmen,51,1300.0000,1295.3092,40.507980,STB,Bombers,56,1300.0000,1304.6908,A,L,0.359935,NaN
9,5,194611020STB,NBA,0,1947,11/2/1946,1,0,STB,Bombers,56,1300.0000,1304.6908,41.492020,PIT,Ironmen,51,1300.0000,1295.3092,H,W,0.640065,NaN

In [19]:
with pd.option_context("display.max.columns", None, "display.precision", 2):
    df_nba.head(10)
    display (df_nba.head(10))

,gameorder,game_id,lg_id,_iscopy,year_id,date_game,seasongame,is_playoffs,team_id,fran_id,pts,elo_i,elo_n,win_equiv,opp_id,opp_fran,opp_pts,opp_elo_i,opp_elo_n,game_location,game_result,forecast,notes
0,1,194611010TRH,NBA,0,1947,11/1/1946,1,0,TRH,Huskies,66,1300.00,1293.28,40.29,NYK,Knicks,68,1300.00,1306.72,H,L,0.64,NaN
1,1,194611010TRH,NBA,1,1947,11/1/1946,1,0,NYK,Knicks,68,1300.00,1306.72,41.71,TRH,Huskies,66,1300.00,1293.28,A,W,0.36,NaN
2,2,194611020CHS,NBA,0,1947,11/2/1946,1,0,CHS,Stags,63,1300.00,1309.65,42.01,NYK,Knicks,47,1306.72,1297.07,H,W,0.63,NaN
3,2,194611020CHS,NBA,1,1947,11/2/1946,2,0,NYK,Knicks,47,1306.72,1297.07,40.69,CHS,Stags,63,1300.00,1309.65,A,L,0.37,NaN
4,3,194611020DTF,NBA,0,1947,11/2/1946,1,0,DTF,Falcons,33,1300.00,1279.62,38.86,WSC,Capitols,50,1300.00,1320.38,H,L,0.64,NaN
5,3,194611020DTF,NBA,1,1947,11/2/1946,1,0,WSC,Capitols,50,1300.00,1320.38,43.14,DTF,Falcons,33,1300.00,1279.62,A,W,0.36,NaN
6,4,194611020PRO,NBA,1,1947,11/2/1946,1,0,BOS,Celtics,53,1300.00,1294.85,40.46,PRO,Steamrollers,59,1300.00,1305.15,A,L,0.36,NaN
7,4,194611020PRO,NBA,0,1947,11/2/1946,1,0,PRO,Steamrollers,59,1300.00,1305.15,41.54,BOS,Celtics,53,1300.00,1294.85,H,W,0.64,NaN
8,5,194611020STB,NBA,1,1947,11/2/1946,1,0,PIT,Ironmen,51,1300.00,1295.31,40.51,STB,Bombers,56,1300.00,1304.69,A,L,0.36,NaN
9,5,194611020STB,NBA,0,1947,11/2/1946,1,0,STB,Bombers,56,1300.00,1304.69,41.49,PIT,Ironmen,51,1300.00,1295.31,H,W,0.64,NaN

In [22]:
df_patient.describe()

       patient_id         age  contacted_with
count  893.000000  156.000000       27.000000
mean   447.000000   48.108974       30.555556
std    257.931192   16.627833       36.051601
min      1.000000    2.000000        1.000000
25%    224.000000   36.000000        1.000000
50%    447.000000   49.000000        1.000000
75%    670.000000   59.000000       74.000000
max    893.000000   86.000000       83.000000

In [23]:
df_patient.describe(include="object")

,gender,nationality,province,current_state,confirmed_date,released_date,deceased_date,hospital
count,156,156,156,166,893,5,4,17
unique,2,2,10,3,20,3,2,4
top,male,indonesia,DKI Jakarta,isolated,24-Mar-20,11-Mar-20,12-Mar-20,RSPI Sulianti Saroso
freq,91,147,124,143,106,2,2,8

In [24]:
df_patient.describe(include="all")

,patient_id,gender,age,nationality,province,current_state,contacted_with,confirmed_date,released_date,deceased_date,hospital
count,893.000000,156,156.000000,156,156,166,27.000000,893,5,4,17
unique,NaN,2,NaN,2,10,3,NaN,20,3,2,4
top,NaN,male,NaN,indonesia,DKI Jakarta,isolated,NaN,24-Mar-20,11-Mar-20,12-Mar-20,RSPI Sulianti Saroso
freq,NaN,91,NaN,147,124,143,NaN,106,2,2,8
mean,447.000000,NaN,48.108974,NaN,NaN,NaN,30.555556,NaN,NaN,NaN,NaN
std,257.931192,NaN,16.627833,NaN,NaN,NaN,36.051601,NaN,NaN,NaN,NaN
min,1.000000,NaN,2.000000,NaN,NaN,NaN,1.000000,NaN,NaN,NaN,NaN
25%,224.000000,NaN,36.000000,NaN,NaN,NaN,1.000000,NaN,NaN,NaN,NaN
50%,447.000000,NaN,49.000000,NaN,NaN,NaN,1.000000,NaN,NaN,NaN,NaN
75%,670.000000,NaN,59.000000,NaN,NaN,NaN,74.000000,NaN,NaN,NaN,NaN
max,893.000000,NaN,86.000000,NaN,NaN,NaN,83.000000,NaN,NaN,NaN,NaN

In [29]:
#Cara akses nama kolom/indeks kolom di dataframe
df_patient["province"]
#type(df_patient["province"])

0      DKI Jakarta
1      DKI Jakarta
2      DKI Jakarta
3      DKI Jakarta
4      DKI Jakarta
          ...
888            NaN
889            NaN
890            NaN
891            NaN
892            NaN
Name: province, Length: 893, dtype: object

In [31]:
df_patient["province"].value_counts()

DKI Jakarta         124
Jawa Barat            9
Jawa Timur            7
Banten                6
Jawa Tengah           4
Kalimantan Barat      2
Sulawesi Utara        1
Kepulauan Riau        1
DI Yogyakarta         1
Bali                  1
Name: province, dtype: int64

In [33]:
df_patient["current_state"].value_counts()

isolated    143
deceased     15
released      8
Name: current_state, dtype: int64

In [5]:
df_patient["current_state"].nunique()

3

In [6]:
df_patient["current_state"].unique()

array(['released', 'isolated', 'deceased', nan], dtype=object)

In [9]:
df_patient[["gender", "confirmed_date", "hospital"]]

     gender confirmed_date              hospital
0    female       2-Mar-20  RSPI Sulianti Saroso
1    female       2-Mar-20  RSPI Sulianti Saroso
2    female       6-Mar-20  RSPI Sulianti Saroso
3    female       6-Mar-20  RSPI Sulianti Saroso
4      male       8-Mar-20       RS Persahabatan
..      ...            ...                   ...
888     NaN      26-Mar-20                   NaN
889     NaN      26-Mar-20                   NaN
890     NaN      26-Mar-20                   NaN
891     NaN      26-Mar-20                   NaN
892     NaN      26-Mar-20                   NaN

[893 rows x 3 columns]

In [10]:
df_patient.loc[:, ["gender", "confirmed_date", "hospital"]]

     gender confirmed_date              hospital
0    female       2-Mar-20  RSPI Sulianti Saroso
1    female       2-Mar-20  RSPI Sulianti Saroso
2    female       6-Mar-20  RSPI Sulianti Saroso
3    female       6-Mar-20  RSPI Sulianti Saroso
4      male       8-Mar-20       RS Persahabatan
..      ...            ...                   ...
888     NaN      26-Mar-20                   NaN
889     NaN      26-Mar-20                   NaN
890     NaN      26-Mar-20                   NaN
891     NaN      26-Mar-20                   NaN
892     NaN      26-Mar-20                   NaN

[893 rows x 3 columns]

In [18]:
df_patient.loc[:, "gender"] #command ini menghasilkan tipe data series

0      female
1      female
2      female
3      female
4        male
        ...
888       NaN
889       NaN
890       NaN
891       NaN
892       NaN
Name: gender, Length: 893, dtype: object

In [21]:
df_patient.loc[:, ["gender"]]
#df_patient.loc[:, ["gender"]].info() #command ini menghasilkan tipe data dataframe

     gender
0    female
1    female
2    female
3    female
4      male
..      ...
888     NaN
889     NaN
890     NaN
891     NaN
892     NaN

[893 rows x 1 columns]

In [23]:
df_patient["gender"].value_counts()

male      91
female    65
Name: gender, dtype: int64

In [22]:
df_patient.loc[df_patient["gender"]=="female", ["gender", "confirmed_date", "hospital"]]

     gender confirmed_date              hospital
0    female       2-Mar-20  RSPI Sulianti Saroso
1    female       2-Mar-20  RSPI Sulianti Saroso
2    female       6-Mar-20  RSPI Sulianti Saroso
3    female       6-Mar-20  RSPI Sulianti Saroso
6    female       9-Mar-20                   NaN
..      ...            ...                   ...
157  female      17-Mar-20                   NaN
160  female      17-Mar-20                   NaN
161  female      17-Mar-20                   NaN
164  female      17-Mar-20                   NaN
168  female      17-Mar-20                   NaN

[65 rows x 3 columns]

In [24]:
df_patient.loc[df_patient["gender"]=="male", ["gender", "confirmed_date", "hospital"]]

    gender confirmed_date              hospital
4     male       8-Mar-20       RS Persahabatan
5     male       8-Mar-20       RS Persahabatan
7     male       9-Mar-20                   NaN
9     male       9-Mar-20  RSPI Sulianti Saroso
11    male       9-Mar-20                   NaN
..     ...            ...                   ...
165   male      17-Mar-20                   NaN
166   male      17-Mar-20                   NaN
167   male      17-Mar-20                   NaN
169   male      17-Mar-20                   NaN
170   male      17-Mar-20                   NaN

[91 rows x 3 columns]

In [27]:
df_patient["age"].min(), df_patient["age"].max()

(2.0, 86.0)

In [32]:
df_patient.loc[df_patient["gender"]=="female", "age"].min()

16.0

In [33]:
df_patient.loc[df_patient["gender"]=="female", "age"].max()

80.0

In [34]:
df_patient.loc[df_patient["gender"]=="male", "age"].min()

2.0

In [35]:
df_patient.loc[df_patient["gender"]=="male", "age"].max()

86.0

In [39]:
print(df_patient.loc[df_patient["gender"]=="male", "age"].min())
print(df_patient.loc[df_patient["gender"]=="male", "age"].max())

2.0
86.0

In [38]:
print(df_patient.loc[df_patient["gender"]=="female", "age"].min())
print(df_patient.loc[df_patient["gender"]=="female", "age"].max())

16.0
80.0

In [50]:
city_revenues = pd.Series(
    [4000, 6500, 13000],
    index=["Amsterdam", "London", "Prague"] #jika index kosong, maka secara default akan menghasilkan index 0, 1, 2, dst
)
print (city_revenues)
print (city_revenues.index)

Amsterdam     4000
London        6500
Prague       13000
dtype: int64
Index(['Amsterdam', 'London', 'Prague'], dtype='object')

In [49]:
city_revenues = pd.Series(
    [4000, 6500, 13000],
    #index=["Amsterdam", "London", "Prague"]
)
print (city_revenues)
print (city_revenues.index)

0     4000
1     6500
2    13000
dtype: int64
RangeIndex(start=0, stop=3, step=1)

In [48]:
employee_count = pd.Series({
    "Engineers": 10,
    "Business" : 5,
    "Human Resources" : 3
})
print (employee_count)

Engineers          10
Business            5
Human Resources     3
dtype: int64

In [55]:
employee_count = pd.Series({
    "Amsterdam": 10,
    "London" : 5,
    "Prague" : 3
})
print (employee_count)

Amsterdam    10
London        5
Prague        3
dtype: int64

In [61]:
city_data = pd.DataFrame({
    "Revenues": city_revenues,
    "employee_count": employee_count
})
city_data

           Revenues  employee_count
Amsterdam      4000              10
London         6500               5
Prague        13000               3

In [62]:
city_data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, Amsterdam to Prague
Data columns (total 2 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Revenues        3 non-null      int64
 1   employee_count  3 non-null      int64
dtypes: int64(2)
memory usage: 152.0+ bytes

In [66]:
city_data.columns

Index(['Revenues', 'employee_count'], dtype='object')

In [68]:
print (city_data.columns)
print (df_patient.columns)
print (df_nba.columns)

Index(['Revenues', 'employee_count'], dtype='object')
Index(['patient_id', 'gender', 'age', 'nationality', 'province',
       'current_state', 'contacted_with', 'confirmed_date', 'released_date',
       'deceased_date', 'hospital'],
      dtype='object')
Index(['gameorder', 'game_id', 'lg_id', '_iscopy', 'year_id', 'date_game',
       'seasongame', 'is_playoffs', 'team_id', 'fran_id', 'pts', 'elo_i',
       'elo_n', 'win_equiv', 'opp_id', 'opp_fran', 'opp_pts', 'opp_elo_i',
       'opp_elo_n', 'game_location', 'game_result', 'forecast', 'notes'],
      dtype='object')

In [79]:
df_nba.iloc[:10, [0, 1]]

   gameorder       game_id
0          1  194611010TRH
1          1  194611010TRH
2          2  194611020CHS
3          2  194611020CHS
4          3  194611020DTF
5          3  194611020DTF
6          4  194611020PRO
7          4  194611020PRO
8          5  194611020STB
9          5  194611020STB

In [78]:
df_nba.loc[0]

gameorder                   1
game_id          194611010TRH
lg_id                     NBA
_iscopy                     0
year_id                  1947
date_game           11/1/1946
seasongame                  1
is_playoffs                 0
team_id                   TRH
fran_id               Huskies
pts                        66
elo_i                    1300
elo_n                 1293.28
win_equiv             40.2948
opp_id                    NYK
opp_fran               Knicks
opp_pts                    68
opp_elo_i                1300
opp_elo_n             1306.72
game_location               H
game_result                 L
forecast             0.640065
notes                     NaN
Name: 0, dtype: object